# for i in range(5):
#     print(1)
# __________________________________________________
# for i in range(5):
#     print(1, end = ", ")
#___________________________________________________

# for i in range(5)           :#range - діапазон чисел
#     print(i, end = " ") #0 1 2 3 4

# for i in "String":
#     print(i, end = " ")
#     print(1, end = " ") #S 1 t 1 r 1 n 1 g 1
#___________________________________________________
#___________________________________________________

# while True:
#     print(1)    # безкінечний цикл
#___________________________________________________

# n = 10
# while n > 0:
#     print(1)
#     n -= 1   # вивів 10 одиничок стовпчиком

# n = 10
# while n > 0:
#     print(1, end = " ")
#     n -= 1   # вивів 10 одиничок в рядок
#___________________________________________________

# n = 10
# while n > 0:
#     if n % 2 == 0:
#         n -= 1
#         continue
#     elif n == 3:
#         break
#     print(n, end = "    ")
#     n -= 3


# n = input()

# print(f'''
#    _~_    
#   (o o)   
#  /  V  \  
# /(  1  )\ 
#   ^^ ^^   
# ''', end = '')

# print("   _~_" *n)
# print("  (o o)")
# print(" /  V  \")
# print("/(  1  )\")
# print("  ^^ ^^  ")


# n = int(input())
# p1 = "    _~_    "
# p2 = "   (o o)   " 
# p3 = "  /  V  \\  "
# p5 = "   ^^ ^^   "

# print(p1 * n)
# print(p2 * n)
# print(p3 * n)

# nums = " 1 2 3 4 5 6 7 8 9"[:2*n]
# p4 = " /(  " + "  )\\  /(  ".join(nums.split()) + "  )\\ "
# print(p4)
# print(p5 * n)

# for n in range(1,10):
#     print(f"  /(   {n}   )\\", end=" ")


