# Tasks for lesson on the topic of "Loops: for and while"
# --------------------------------------------------------

#1. Виведіть повідомлення Hello, Python! на екран n разів (n - ціле число, яке вводить користувач).

# n = int(input("n: "))
# for i in range(n):
#     print("Hello, Python!")
# __________________________________________________________


#2. Дано два цілих числа a і b (a ≤ b). Виведіть всі числа від a до b включно.

# a = int(input("a: "))
# b = int(input("b: "))

# i = a
# while i <= b:
#     print(i)
#     i += 1
# __________________________________________________________

#3. Напишіть програму-таймер зворотного відліку, яка запитує у користувача кількість секунд n, з якої слід починати відлік.

# n = int(input("Кількість секунд: "))
# for i in range(n, 0, -1): # починаю з n, стоп на 0, зменшувати кожного разу
#     print(i)
# print("Start!")
# __________________________________________________________

# 4. Користувач вводить кількість навчальних предметів n, а потім, відповідно, оцінки учня з n навчальних предметів. Визначте середню оцінку.

# n = int(input("Кількість предметів: "))
# n_marks = 0
# for i in range(n):
#     mark = int(input(f"Оцінка {i+1} : "))
#     n_marks += mark
# avg = n_marks / n
# print("Середня оцінка: ", avg)

# __________________________________________________________

# 5. Надрукувати у рядку m разів число n. Числа m і n - цілі числа, які вводить користувач у порядку n, m.
# n = int(input("Enter n: "))
# m = int(input("Enter m: "))
# for i in range(m):
#     print(n, end = " ")
# __________________________________________________________

# 6. Напишіть програму для друку цілих чисел від n до 0 із виведенням біля кожного числа кількості символів #, що дорівнює значенню числа.
# n = int(input("Enter n: "))
# for i in range(n, 0, -1):
#     print(i, "#"*i)

# __________________________________________________________

# 7. Напишіть програму для побудови шаблону як у вихідних даних за введеним значенням n.
# n = int(input("Enter n: "))
# for i in range(1, n+1):
#     print(str(i)*i)

# __________________________________________________________

# 8. Намалювати сходинки як у вихідних даних, використовуючи символи пропуску і решітки #, коли на вхід програми подається ціле число n - кількість сходинок.
# n = int(input("Enter n: "))
# for i in range(1, n+1):
#     print(str("#")*i)

# __________________________________________________________

# 9. За даним цілим додатнім числом n обчисліть n! - значення факторіалу цього числа.
# Факторіал: n! = 1 * 2 * 3 * ... * (n-1) * n
# n = int(input("Enter n: "))
# f = 1
# for i in range(1, n+1):
#     f *= i
# print("Factorial: ", f)

# __________________________________________________________

# 10. Автогонщик в перший день ралі проїхав d км. Кожен наступний день він збільшував пробіг на 10% від пробігу попереднього дня. Через скільки днів автоспортивних змагань сумарний пробіг автомобіля за всі дні перевищить t км і яке значення сумарного пробігу? Введення даних користувачем відбувається в порядку: d, t.

# d = float(input("Enter 1 day km: "))
# t = float(input("Total mileage km: "))
# distance = d
# days = 1
# while distance <= t:
#     d *= 1.1 #збільшував пробіг на 10% 
#     distance += d
#     days += 1
# print(f"{distance:.2f} km,{days} days")

# __________________________________________________________

# 11. Дано ціле число n. З чисел 1, 4, 9, 16, 25, …​ надрукувати ті, які не перевищують n. (зверніть увагу на задану послідовність)

# n = int(input("Enter n: "))
# i = 1
# while i*i<=n:
#     print(i*i)
#     i += 1
# __________________________________________________________

# 12. Дано цілі числа a і b. Обчислити a ^ b (a в степені b), не використовуючи операцію піднесення до степеня.
# a = int(input("Enter a: "))
# b = int(input("Enter b: "))
# ab = 1
# for i in range(b):
#     ab *= a
# print("Результат: ", ab)

# __________________________________________________________

# 13. Дано натуральне число n. Визначити, чи є воно автоморфним числом.
# Примітка: Автоморфне число - число, квадрат якого рівний останнім розрядами квадрата цього числа: 5 - 25, 6 - 36, 25 - 625.

# n = int(input("Enter n: "))
# n_squared = n*n
# temp = n
# n_value = True
# while temp > 0:
#     if temp % 10 != n_squared % 10:
#         n_value = False
#         break
#     temp //=10
#     n_squared //=10
# print(n_value)
# __________________________________________________________

# 14. Дано натуральне число n. Надрукуйте всі n-значні непарні натуральні числа в порядку спадання.
# n = int(input("Enter n: "))


# __________________________________________________________

# 15. Написати програму для обчислення суми цифр цілого числа n. Програма має враховувати, що на вхід може подаватися ціле від’ємне число.
# n = int(input("Enter n: "))
# __________________________________________________________

# 16. Напишіть програму для отримання рядка Фібоначчі від 0 до n, де n - ціле число.
# Послідовність Фібоначчі - це серія чисел 0, 1, 1, 2, 3, 5, 8, 13, 21, .... Кожне наступне число знайдено шляхом додавання двох номерів перед ним.
# n = int(input("Enter n: "))

# __________________________________________________________

# 17. За введеним користувачем цілим числом n визначте n-е число Фібоначчі.
# n = int(input("Enter n: "))
# first = 0
# last = 1
# for i in range(2, n+1):
#     temp = first + last
#     first = last
#     last = temp
# print(last)