# 6. Напишіть програму для створення словника із введеного рядка символів для підрахунку кількості символів.

# Вхідні дані: Lorem ipsum dolor sit amet

# text = input("Enter text: ")
def task6():
    text = "Lorem ipsum dolor sit amet"
    symbols = []    # порожній список 

    for n in text:
        if n not in symbols:    
            symbols.append(n)#якщо символ ще не був доданий, додаємо без повторів

    symbol_count = {}

    for n in symbols:   #проходимо по кожному символу зі списку
        symbol_count[n] = text.count(n)#підрахунок кількості symbol в text

    print(symbol_count)
# task6()


# 7. Напишіть програму, яка приймає рядок символів, і обчислює кількість букв і цифр.

# Вхідні дані: Project Gutenberg offers over 59,000 free eBooks
# Вихідні дані: LETTERS 36 DIGITS 5


text = input("Entert text: ")





# 8. Напишіть програму для видалення дублікатів зі списку цілих чисел.

# 9. Дано список словників. Кожен словники має 2 пари елементів: ключ 'name' і значення імені студента, ключ 'points' і значення - список балів з різних дисциплін (цілі двоцифрові числа). Надрукуйте найменші значення балів, отримані кожним студентом, в один рядок з пропуском.




# 10. Дано два списки чисел. Порахуйте, скільки унікальних цифр міститься в обох з них.



# 11. Дано три словники, в яких ключами є малі букви латинського алфавіту, а значеннями - цілі числа. Ключі у всіх словниках – різні, їх є по 3 в кожному словнику. Об’єднайте всі три словники в один і виведіть його вміст. Підказка. скористайтеся оператором **, що використовується для об’єднання довільної кількості словників.


# 12. Створіть словник, який відображає ідентифікатори акцій на біржі. Ключами словника є ідентифікатори акцій, а значеннями - дійсні числа - ціни акцій. Надрукуйте ціни акцій та ідентифікатори у порядку зростання ціни.




# 13. В рядку записаний текст. Словом вважається послідовність непробільних символів, які йдуть підряд, слова розділені одним або більшим числом пропуском або символами кінця рядка. Для кожного слова з цього тексту підрахуйте, скільки разів воно зустрічалося в цьому тексті раніше.



# 14. Напишіть програму, яка зможе підрахувати слова у введеному рядку, розділені пропуском і вивести отриману статистику: для кожного унікального слова обчислити число його повторень (без урахування регістру), слова не повинні повторюватися, порядок слів довільний.


# 15. Дано два списки чисел. Знайдіть всі числа, що зустрічаються як в першому, так і другому списках, і надрукуйте їх у порядку зростання.



# 16. Напишіть програму, яка вміє шифрувати і розшифровувати використовуючи шифр підстановки. Програма приймає на вхід два рядки однакової довжини, у першому рядку записані символи початкового алфавіту, у другому рядку - символи кінцевого алфавіту (шифр підстановки), після чого йде рядок, який потрібно зашифрувати переданим шифром підстановки, і ще один рядок, який потрібно розшифрувати.