#String (рядки)

#1. Напишіть програму, яка по введеному числу n від 1 до 9 виводить на екран n пінгвінів з відповідним номером - число від 1 до n. Зображення одного пінгвіна має розмір 5 х 9 символів, між двома сусідніми пінгвінами також є порожній (з пропусків) стовпець. Дозволяється вивести порожній стовпець після останнього пінгвіна. Для спрощення малювання скопіюйте пінгвіна із вихідних данних. врахуйте, що виведення на екран виконується порядково, а не "попінгвінно".

# n = int(input())
# p1 = "    _~_    "
# p2 = "   (o o)   " 
# p3 = "  /  V  \\  "
# p5 = "   ^^ ^^   "

# print(p1 * n)
# print(p2 * n)
# print(p3 * n)

# nums = " 1 2 3 4 5 6 7 8 9"[:2*n]
# p4 = " /(  " + "  )\\  /(  ".join(nums.split()) + "  )\\ "
# print(p4)
# print(p5 * n)

# for n in range(1,10):
#     print(f"  /(   {n}   )\\", end=" ")
#_________________________________________________________________________________________

#2. У рядку є кілька слів, розділених одним або декількома пропусками. Потрібно прибрати з тексту зайві пропуски: два і більше пропусків поспіль, а також всі пропуски на початку і в кінці рядка. На вхід програмі подається рядок, що складається не більше ніж з 255 символів. Надрукувати новий рядок.

# Вхідні дані:
# Beyond the green      swelling hills of the   Mittel Land rose mighty slopes of forest     up    to the lofty steeps of the Carpathians     themselves

# text = "    Beyond the green     swelling hills of the     Mittel Land rose mighty slopes of forest    up    to the lofty steeps of the Carpathians    themselves"
# new_text = " ".join(text.split())
# print(new_text)

#_________________________________________________________________________________________

#3.Дано рядок, що складається з n цифр (тобто одноцифрових чисел), між якими стоїть n-1 знаків операцій, кожна з яких може бути або +, або -. Обчисліть значення цього виразу. Програма має надрукувати результат обчислення цього виразу.
# Вхідні дані:
# 5-3+1
# 6+3-2
# Вихідні дані:
# 3
# 7

# n = input("Вхідні дані: ")
# n_new = int(n[0])
# for i in range(1, len(n), 2):
#     symbol = n[i]
#     num = int(n[i+1])
#     if symbol == '+':
#         n_new += num
#     else:
#         n_new -= num
# print(n_new)
#_________________________________________________________________________________________

#4.Напишіть програму, на вхід якої даються чотири числа a, b, c, i d, кожне у своєму рядку. Програма повинна вивести фрагмент таблиці множення для всіх чисел відрізка [a; b] на всі числа відрізка [c; d].
# Числа a, b, c, i d є натуральними і не перевищують 10, a ≤ b, c ≤ d. Дотримуйтеся формату виведення як у вихідних даних. Для поділу елементів всередині рядка використовуйте \t — символ табуляції.
# Зауважте, що лівим стовпчиком і верхнім рядком виводяться самі числа із заданих відрізків.
# Вхідні дані:
# a = int(input())
# b = int(input())
# c = int(input())
# d = int(input())
# print("\t" + "\t".join(str(n) for n in range(c, d + 1) ))
# for i in range( a, b + 1):
#     row = [str(i)] + [str(i*j) for j in range (c, d + 1)]
#     print("\t".join(row))
#_________________________________________________________________________________________



#5.Напишіть програму для друку літери A за допомогою введеного користувачем символа.

# Вхідні дані: *

# symbol = input("Введіть символ: ")
# print(" " + symbol*3 )
# print(symbol + "   " + symbol)
# print(symbol + "   " + symbol)
# print(symbol*5)
# print(symbol + "   " + symbol)
# print(symbol + "   " + symbol)
# print(symbol + "   " + symbol)
