# print("QWERTYfgdg555".upper()) #всі великі
# print("QWERTYfgdg555".lower()) #всі малі

# print("QWERTYfgdg555".isdigit())

# name = "Alisa"
# print(f"Hello, {name}! How are you?")
#________________________________________________________________________________________________________________

ex = input("Enter ex:\n") #5-3+1
len_ex = len(ex) #5

n = (len(ex) + 1)//2 #



#________________________________________________________________________________________________________________


#1 Напишіть програму, яка приймає від користувача рядок, і відображає цей рядок у верхньому і нижньому регістрах.
# line = input("Введіть рядок: ")
# print(line.upper())
# print(line.lower())

#-------------------------------------------------------------------------------

#2 Скласти програму, яка запитує назву баскетбольної команди і повторює її на екрані зі словами: This is a champion!.

# basket_team = input("Введіть назву баскетбольної команди: ")
# print(f"Team, {basket_team} is a champion!")

#-------------------------------------------------------------------------------
# Дано натуральне число. Знайти число, що отримується при прочитанні його цифр справа наліво.





# Дано рядок. Змініть регістр символів в цьому рядку так, щоб перша буква кожного слова була великою, а інші літери - малими. (метод s.title())






# Дано рядок. Визначити порядковий номер першої вказаної букви. Якщо такої літери немає, вивести нуль.