# Сума двох чисел: Написати програму, яка зчитує два цілих числа та виводить їх суму.

# n1 = int(input("Enter number 1:"))
# n2 = int(input("Enter number 2:"))
# print(n1 + n2)
#-------------------------------------------------------------------------------

# Гіпотенуза: За двома катетами прямокутного трикутника знайти довжину його гіпотенузи.
# import math
# a = int(input("Enter 1 length:"))
# b = int(input("Enter 2 length:"))
# print( math.sqrt(a**2 + b**2))
#-------------------------------------------------------------------------------

# Двічі: Написати програму, яка зчитує ціле число та виводить його двічі.
# m = int(input("Enter number:"))
# print(m, m)
#-------------------------------------------------------------------------------

# Привіт, <ім'я>: Написати програму, яка запитує ім'я користувача і виводить привітання.
# name = input("Name:")
# print("Hello, ", name)
#-------------------------------------------------------------------------------

# Прощавай, <ім'я>: Написати програму, яка запитує ім'я користувача і виводить прощання.
# name_ = input("Name:")
# print("Goodbye, ", name_)
#-------------------------------------------------------------------------------

# Вік через рік: Напишіть програму, яка запитує ім'я користувача та його вік. Потім виведіть повідомлення, яке повідомляє, скільки йому буде років через рік.
#name_1 = input("Name:")
#age = int(input("Age:"))
#print("Name: ", name_1, " Age next year:", age + 1)
#-------------------------------------------------------------------------------

# Площа прямокутника: Напишіть програму, яка запитує довжину та ширину прямокутника, а потім обчислює та виводить його площу.
# length_ = int(input("length: "))
# width_ = int(input ("width: "))
# square = length_ * width_
# print("square: ", square)
#-------------------------------------------------------------------------------

# Конвертер валют: Запропонуйте користувачеві ввести суму в одній валюті (наприклад, доларах), а потім виведіть цю суму в іншій валюті (наприклад, євро), використовуючи заздалегідь визначений коефіцієнт обміну.
# usd = float(input("usd: "))
# change = 0.75
# eur = usd*change
# print("eur: ", eur)
#-------------------------------------------------------------------------------

# Вартість покупки: Запитайте користувача назву товару, його ціну та кількість. Обчисліть загальну вартість покупки та виведіть її на екран.
# product = input("product: ")
# price = float(input("price: "))
# count = float(input("count: "))
# sum = price*count
# print("Вартість покупки: ", sum)
#-------------------------------------------------------------------------------

# Температура: Напишіть програму, яка перетворює температуру з градусів Цельсія на Фаренгейт. Запитайте користувача температуру в градусах Цельсія.
degrees_celsius = float(input("degrees Celsius: "))

degrees_fahrenheit = (degrees_celsius * 9 /5) +32
print("degrees Fahrenheit: ", degrees_fahrenheit)