# Домашнє завдання:

# Задача 1. Середнє трьох чисел
# Користувач вводить три числа. Обчисли середнє арифметичне.

# n1 = float(input("Enter number 1:"))
# n2 = float(input("Enter number 2:"))
# n3 = float(input("Enter number 2:"))
# print((n1 + n2 + n3)/3)
#-------------------------------------------------------------------------------

# Задача 2. Остача від ділення
# # Користувач вводить два числа. Знайди остачу від ділення першого на друге.
# n_1_ = float(input("Enter number 1:"))
# n_2_ = float(input("Enter number 2:"))
# print(n_1_ % n_2_)
#-------------------------------------------------------------------------------

# Задача 3. Подвоєне число
# Користувач вводить число. Виведи подвоєне значення цього числа.
# num = float(input("Enter number :"))
# print(num * 2)
#-------------------------------------------------------------------------------

# Задача 4. Конвертація хвилин у секунди
# Користувач вводить кількість хвилин. Обчисли, скільки це буде секунд.
# min = float(input("Enter number of minutes :"))
# sec = float(min*60)
# print("Amount number of secunds: ", sec)
#-------------------------------------------------------------------------------

# Задача 5. Кількість яблук на кожного
# Є n яблук і k учнів. Скільки яблук отримає кожен учень, якщо ділити порівну, і скільки залишиться?
# apples = int(input("Enter number of apples :"))
# students = int(input("Enter number of students :"))
# print("Each student will recieve ", apples // students, " apples")
# print( apples % students, " apples left")
#-------------------------------------------------------------------------------

# Задача 6. Остання цифра числа
# Користувач вводить число. Виведи його останню цифру.
# number = float(input("Enter number:"))
# print(number % 10)
#-------------------------------------------------------------------------------

# Задача 7*. Обмін змінних
# Користувач вводить два числа. Після цього потрібно “поміняти” їх місцями і вивести результат.

number_1 = float(input("Enter number 1:"))
number_2 = float(input("Enter number 2:"))
print("number 1: ", number_2)
print("number 2: ", number_1)